{
  "recruiterName": "Andrew Stoe",
  "recruiterEmail": "andrew.stoe.ne@cocodelivery.com",
  "company": "Coco Robotics",
  "jobTitle": "Senior Software Engineer",
  "team": "Platform Delivery",
  "bookingLink": "https://calendly.com/alex-fenstermacher-ne-cocodelivery/30min?month=2025-02",
  "emailContent": "Hi,\n\nI want to share a truly unique opportunity with you.\n\nAt Coco, we’re not just building delivery robots but redefining urban logistics.\nWe’re looking for a Senior Software Engineer to lead product and design development on our Platform Delivery team.\n\nYou’ll be the cornerstone of our Platform Delivery team, working to design and implement systems that power the next generation of autonomous vehicles. With access to millions of miles of proprietary data and a mission to scale 1,000,000s of deliveries, your work will lay the foundation for Coco’s success for years to come.\n\nWhat makes this role unique?\n\nYou’ll build backend services that make automated decisions based on user behaviors, communicate with devices, and track information.\n\nYou'll partner with other Coco teams (e.g., Merchant Operations, Consumer Experience, Autonomy, and more), acting as a thought partner to tackle some of Coco’s most pressing efficiency and profitability initiatives.\nYou’ll lead with impact, not just building systems but setting the tone for the Platform Delivery team that we’re growing.\n\nYour experience at Waymo in building complex mapping tools makes you well-suited to tackle the challenges of our Platform Delivery team. It would make you an incredible fit for this opportunity.\n\nIf shaping the future of urban logistics and building something very complex from scratch resonates with you, let’s connect. I’d love to share more about what we’re building at Coco and explore how your vision and expertise can help lead us into the future.\n\nAre you interested in finding a time to speak this week? If so, please feel free to book some time with me here.\n\nBest regards,\nAlex\nCoco Robotics"
}
